package com.app.homeworknumberthree

object QuestionRepository {
    val questions = mutableListOf(
        Question(
            questionText = "В какой стране впервые начали играть в футбол?",
            options = mutableListOf("Англия","Китай","Италия","Германия"),
        ),
        Question(
            questionText = "Какова стандартная продолжительность футбольного матча, исключая дополнительное время?",
            options = mutableListOf("45 минут","60 минут","90 минут","120 минут"),
        ),
        Question(
            questionText = "Как называется ситуация, когда игрок забивает три гола в одной игре?",
            options = mutableListOf("Хет-трик","Тройной удар","Супер удар","Трио голов"),
        ),
        Question(
            questionText = "Сколько игроков в стандартной футбольной команде?",
            options = mutableListOf("7","10","11","12"),

        ),
        Question(
            questionText = "Какое максимальное количество замен разрешено в стандартном футбольном матче?",
            options = mutableListOf("2","3","4","5"),

        ),
        Question(
            questionText = "Какова окружность стандартного футбольного мяча?",
            options = mutableListOf("60–65 см","70–75 см","80–85 см","90–95 см"),
        ),
        Question(
            questionText = "Как называется ситуация, когда счет в конце футбольного матча остается ничейным?",
            options = mutableListOf("Ничья","Повторный матч","Овертайм","Серия пенальти"),
        ),
        Question(
            questionText = "Какая часть тела не может касаться мяча во время футбольного матча?",
            options = mutableListOf("Голова","Грудь","Руки","Ладони"),
        ),
        Question(
            questionText = "Какое максимальное количество желтых карточек может получить игрок, прежде чем его исключат из матча?",
            options = mutableListOf("1","2","3","4"),
        ),
        Question(
            questionText = "Кто известен как “Черная жемчужина” и считается одним из величайших футболистов всех времен?",
            options = mutableListOf("Лионель Месси","Криштиану Роналду","Пеле","Диего Марадона"),

        ),
        Question(
            questionText = "Как называется зона перед воротами, где вратарь - единственный игрок, которому разрешено использовать руки?",
            options = mutableListOf("Вратарская","Зона ворот","Зона голкипера","Штрафная площадка"),
        ),
        Question(
            questionText = "Сколько раз сборная Бразилии выигрывала чемпионат мира по футболу?",
            options = mutableListOf("2","3","4","5"),
        ),
    )
}